{
  "title": "Trump’s Plan to Reorder the World",
  "source": "NYT The Daily",
  "feed_url": "https://feeds.simplecast.com/Sl5CSM3S",
  "pub_date": "2025-12-12T10:45:00+00:00",
  "duration": "00:35:54",
  "audio_url": "https://dts.podtrac.com/redirect.mp3/pdst.fm/e/pfx.vpixl.com/6qj4J/pscrb.fm/rss/p/nyt.simplecastaudio.com/03d8b493-87fc-4bd1-931f-8a8e9b945d8a/episodes/4b70ef33-ff51-4c3e-a5cd-5f0c41880d27/audio/128/default.mp3?aid=rss_feed&awCollectionId=03d8b493-87fc-4bd1-931f-8a8e9b945d8a&awEpisodeId=4b70ef33-ff51-4c3e-a5cd-5f0c41880d27&feed=Sl5CSM3S",
  "transcription_engine": "whisper",
  "transcript": "From the New York Times, I'm Natalie Kietroweth. This is the date. From slamming Europe and abandoning our commitments to our closest allies there, to carrying out a lethal U.S. military campaign in the Caribbean, President Trump has overseen an aggressive foreign policy that hasn't always been easy to understand. But the White House has now unveiled a national security strategy that offers a justification for those actions, laying bare Trump's true goals and alarming countries around the world. Today, my colleague David Sanger explains what the strategy actually is and how the emerging Trump doctrine it represents may change America's global relationships for good. It's Friday, December 12th. David, our resident foreign policy expert, it's great to have you here. Natalie, always great to be with you. There has been a lot of debate on the right among voters about Trump's focus on international affairs, a notion that he's not following through on a stated agenda of putting America and Americans first. And it's true that Trump in his second term has been extremely active around the world. He's been engaging in a trade war with China. He's bombed Iran's nuclear facility, broker to cease fire in Gaza. There's been the recent boat strikes in Latin America. And through all that, it hasn't always been all that clear exactly how all of these actions cohere. But now the Trump administration has released this document that tries to articulate the country's foreign policy strategy, that tries to make sense of it all. So first of all, what is this document? So this is the national security strategy. And administrations don't turn it out because they want to. They turn it out because they have to. Congress actually requires every administration to go do it. But it also ends up becoming a kind of Rorschach test of what administrations priorities are. And in this particular case, as you read this document, it's only about 30 pages long. The thing that really strikes you is that it is a retreat from the post-World War II bipartisan understanding that the role of the United States is to defend liberty, support democracies around the world, support our allies. And there's an absence in this strategy of a sort of moral mission for the United States to defend human rights, to defend free speech or free press. Almost all of that is gone. And instead, there's one really telling line that's on page 12 of the strategy. It says the days of the United States propping up the entire world order like atlas are over. And if those days are over, if that's no longer our priority, being the defender of liberty around the world, what is the new priority? Well, our priority is the latest interpretation of America first. And that means emphasizing not only trade, but making America wealthy. How many times have you heard President Trump say that? He said it again on Tuesday night in Pennsylvania that he would make America rich again on its way to making it great again. It is a document that is very heavy on how the United States will try to order the world for its benefit. You know, I've seen this in the coverage around this document that there is a focus on making America, as you said, wealthy, a focus on profit. What does that actually mean? Well, the president's concept here is that our greatest source of national strength is being the economic leader, the technological leader. Now, parts of this are quite common with Democrats and other Republican presidents. You saw Joe Biden try to bring semiconductor manufacturing back to the United States. But Trump is taking this to the next level here. He's basically saying that all the policies of the U.S. should be geared toward improving our wealth and our economic security. And he focuses many more pages on that than the traditional issues of national security. And what really struck me, Natalie, is this is not only different from most of the national security strategies we've seen since the end of World War II, it's dramatically different from Donald Trump's own national security strategy when he first came to office in 2017. Break that down for me. How is it different from Trump's own previous policy? Well, in 2017, his national security advisor looked around the national security landscape, and basically came to the conclusion that it was all still focused on counterterrorism, the understandable result of 9-11 and its aftermath and the wars in Iraq and Afghanistan. And that national security strategy in 2017 indicated that the U.S. government had to rapidly shift to a new era of superpower conflict, one in which Russia was a rising and aggressive power seeking to challenge the United States and its dominance, particularly in the West and in Europe, and that we had to counter China, the only country that could take us on militarily, financially, technologically, and if you think about something like TikTok, maybe even culturally. And so that document in 2017 basically reoriented the national security establishment of the United States toward thinking about how you would fight a new era of cold wars around the world. In this document, there's a hint of that, but not very much. It focuses on entirely different issues. The old document spent a lot of time on how the United States would deal with threats from rogue states. There are pages on North Korea, which at the time had about 20 nuclear weapons and was run by an erratic leader. In the new document, there's no mention of North Korea, in the entire 30 pages, even though they now have three times as many nuclear weapons, and they're still run by the same erratic leader. And Iran gets only the briefest mention, and then only to mention that the president sent stealth bombers over to take out three major nuclear sites back in June. But there's no follow-up about what the strategy would be to avoid future war with Iran. You're saying, basically, David, that there's much less direct discussion here of our adversaries and how to counter them. North Korea isn't in this document at all. Iran isn't there very much. So what does this document focus on in terms of our national security concerns? Well, Natalie, there's a lot of discussion and a lot of criticism of our closest allies, the Europeans. You know, I think the first thing that you see in this document is something that's pretty familiar to us all from the first term and certainly from the past year, which is that America is tired of supporting the allies, that it won't put up with Europe's trade blocks anymore, that is frustrated with the European Union, which, of course, the president has said was built to screw the United States, that we can't necessarily be supporting them in their conventional defense. And it makes clear that they have to go do that themselves. Now, the fact of the matter is, as the document acknowledges, the Europeans made a lot of progress in this regard over the past year. And you may remember that back over the summer, they committed to spend up to 5 percent of their GDP on defense. And that was a huge win for President Trump. And in my mind, something that was really long overdue and one of the big successes that he had this year. Right, they went from 2 percent of GDP to now saying they'd spend up to 5 percent. It was a huge increase. Huge increase, some of it's for concrete defense. And I think it's certainly fair to say that his threat to leave NATO and to abandon Europe certainly focused their attention. The next big debate we have, of course, is whether or not it was in our interest as well, because we get a lot of benefits from a tight alliance with the Europeans who can act as a deterrent against war with Russia and other bad actors. So yes, it was a big win. It may have come at some long-term cost. But let's acknowledge that President Trump was able to do what Barack Obama and Joe Biden and Trump himself in his first term proved unable to do, which is get the Europeans belatedly to take their defense seriously. So there's clearly an upside from the US perspective in getting Europe to kick in more for its own defense. But as advanced as Europe is, it can't compete with the US military power yet, right? It would take them a long time to build up their militaries to that point. And I guess I wonder if the US is retreating from supporting Europe on defense. That will make Europe less capable of countering what it sees as one of its biggest threats right now, which is Russia. Does this strategy contend with the potential that Russia gains an upper hand over Europe if US military support receipts? So Natalie, the Russia section of this is one of the strangest, because it suggests that the Europeans were a greater threat to themselves than Russia is to the future of Europe. And this is the exact opposite of how the Europeans view it, because they believe now that Russia is an existential threat to them. And if successful in Ukraine will just keep going sooner or later. And that is a huge shift, of course. But it's one that the Europeans have seen coming from the US all year. They may not have seen it in black and white the way they did in the strategy, but it was certainly no surprise. But what they weren't ready for was this line on page 25 of the report that talks about Europe's economic decline. But then it also discusses the waves of migration that have changed the nature of European democracies. And it warns that this economic decline is eclipsed by the real and more stark prospect of civilizational erasure. And that's the line that really resonated in Europe. Yeah, let's just pause there, because that line really made a lot of waves. So what does the Trump administration mean when it says there's civilizational erasure happening in Europe? Well, this has been a topic of great debate about how you interpret that. But I think the most common interpretation is that the president is saying that the migration that has changed the face of Germany, of France, even of Britain has fundamentally altered the nature of these European allies, and that Europe that the president came to think up. His parents emerged. His mother was a Scottish immigrant. His father was the first generation descendant of German immigrants to the United States in the late 1880s that that Europe was almost gone. And many read that line as a complaint that there is a diminishment of the white European allies that the president imagines when he thinks of Europe. And I think what this document is doing is saying Europe's threatening its own future existence and identity. Well, you're starting to point at this, David, but just explain why this concept that migration is changing the demographic makeup of Europe and the culture, perhaps, of Europe. Why is it important for the Trump administration? Like what does it have to do with American foreign policy? I think it has to do with their image of countries with common values, not only with the United States, but with President Trump and the MAGA movement. And there was a lot of this in the JD Vance speech to the Munich Security Conference last February that was such a shock where he said, your big adversary is not Russia. Your big adversary is the waves of migration that are changing your societies. And I think the Europeans who viewed that diversity as a strength, a revitalization of Europe, were truly shocked to hear that. And this whole section of the National Security Strategy reads like it is an expansion of the Vance speech in Munich in February. Can I just ask, I understand that there were many Europeans who were shocked by this when Vance brought it up and perhaps have been shocked by it in this document. But it's true, right, that there has been this massive wave of migration across Europe. And there is a lot of discontent with it. There are a lot of people who aren't in favor of it and don't see it as something they want in their countries. That's absolutely right. And you sense this whenever you're in Europe and you just read it in the headlines, see it in protests on the streets, see it in the clashes between these new migrants who are coming in and traditional Europeans. So the core of the Trump argument in this document is basically a warning to the Europeans that you are ignoring your own voters, that you're suppressing free speech by suppressing the right wing by trying to keep them down, by refusing to allow them to take power, right? And that's true in their minds in Germany, in their minds it's true in France, and their minds it's even true in Great Britain. And just explain why that's problematic in the eyes of the Trump administration. Well, to the Trump administration, I think there are sort of two reasons. The stated reason is that a Europe that is divided like this, that is suppressing the will of its own voters, that's keeping the right wing from coming up, is basically an unstable Europe. That can't as the document says, operate as a group of aligned sovereign nations, taking primary responsibility for their own defense without being dominated by an adversarial power. But I think we have to allow for the possibility, Natalie, that what's really going on here is they want like-minded, mega-oriented governments in these nations. And they think the current European establishment is standing in the way of that goal. And so what if anything is the Trump administration saying they're going to do about that problem? Well, they're vague about what they do about it. There is this line saying that among their priorities is cultivating resistance to Europe's current trajectory within European nations. But we don't really know what that means. Does it mean that the president is going to endorse right wing patriotic candidates as if he was endorsing Republican or MAGA-oriented governors or senators running for election in the United States? Would he be interfering in their elections? He doesn't say except in the traitor arena where, of course, he's quite specific about his goals. So just to sum up what you've told us about the Europe policy that's articulated here, this is much of what we've seen already in the Trump administration saying basically Europe you're on your own in terms of paying for your own defense, we're not going to be as involved as we have been. And then you're also seeing this expressed concern over mass migration in Europe and civilizational erasure. So what do you make of this altogether? How should we interpret it? It's hard to tell because parts of it are contradictory, but you emerge from reading the document thinking that the United States is carving out an exception for itself to step in and intervene in Europe to get to the kind of society that President Trump and his allies think they want and think that many Europeans want. And yet buried in this assertion of a right to interfere with Europe's internal politics, even directly engaging with European voters, there's this sort of strange undertone of retreat, a real sense that overall the US is turning away from Europe. And so then the question becomes, if the US is retreating from our traditional European allies, where are we turning? Well, for the past decade, the Europeans have been worried that the US is turning to Asia, that it's focusing on China and Japan and South Korea, the booming economies. But what this document says is that the US is ready once again to turn its attention to our own region, to focus on our own backyard. We'll be right back. David, before the break, you said that this document articulates that our backyard is now the focus of America's foreign policy. So what exactly does the Trump administration want to do in our backyard? And how does it define our backyard? Well, let's start with the second question first, Natalie, because you're talking about a president who spent his life as a real estate mogul. And the real estate he has in mind here is pretty big. It goes from Canada over to Greenland. It runs down through the newly named Gulf of America, through the Panama Canal, which of course he said we never should have given away all the way down to the tip of Argentina. And the president's idea here is that the United States should have complete and total dominance of the Western hemisphere. And so the president advocates in this document that we return to and expand on the Monroe doctrine. Now, at the risk of making some of our listeners shake in fear as they try to recall 11th grade history. Yeah, let's get this spark notes. Absolutely. We're slipping you the copy right now, Natalie. The Monroe doctrine, which dates back to 1823, declared that the Western hemisphere would essentially be closed to European colonization. The Europeans had to stay out of our territory, which was a pretty bold thing to say for a country that was about 45 years old and barely had a navy at the time, right? But over the following 200 years, we both expanded from and retreated from the Monroe doctrine. How so? Well, Teddy Roosevelt in 1905 issued a Roosevelt corollary to this doctrine that basically said we reserve the right to intervene in Latin America if we see governments that are coming together that are not to our liking. And we did exactly that, right? We got involved in a civil uprising in Colombia, and we ended up with the Panama Canal. I mean, we did a whole bunch of actions up through the 1950s when the CIA was conducting coups in the region. But then we turned away for a bit. We had the Cold War, we had the collapse of the Soviet Union, we had 9.11, and we began to think as China rose, that it's really in the Indo-Pacific that we needed to concentrate our forces. What this document is saying is it's time to come home again and to focus on our home region. And when you read the actual document, the president talks about building on the Monroe doctrine and creating a sort of Trump corollary to it. What it's saying is we are going to control access to the region, we're going to stop drugs to the region, and we're going to make sure that you see the US military in the region. And here's where the document gets more specific than in almost any other place in the 30 pages. There's a page where it says we're going to readjust our global military presence to address these urgent threats in our own hemisphere because we live here. Well, that may not sound like a big decision, but we've had a succession of American presidents, Democrats, Republicans alike, who have said we are going to go focus on the Indo-Pacific because that's where our future is, that's where our trade is, that's where China and India are. So this would basically put a halt to that kind of expansion in a world of limited resources and bring those forces back home. It says that we're going to design a more suitable Coast Guard and Navy presence to control sea lines. It says we're going to defeat cartels and put people at the border to do that. And where necessary, the use of lethal force to replace the failed law enforcement only strategy of the last several decades. So what it does is essentially give a retroactive justification or rationale for what we've seen with the US military sinking these boats in the Caribbean and killing alleged drug runners. That's right, it's giving a strategic rationale for things he is wanted to do and is doing anyway, but it even goes beyond that, Natalie, because there are sections of it that explicitly say that to make this work, we're going to kick other powers out of our region. And that's code word for China, because in the past, Natalie, when the US turned its attention away from the Western hemisphere, when his focus was on China and the Indo-Pacific, the irony is that the Chinese were moving into Latin America and really made huge inroads there economically. And that makes it all the stranger that the document doesn't really name China specifically as the big player in the region. And there's been some debate about why that is. Some people think it was the work of Scott Besan, the Treasury Secretary, who's trying to negotiate trade deals with China. He doesn't want to particularly anger them before President Trump's schedule visit to Beijing in April. But what it certainly does is it suggests the US is going to boot out anybody who it thinks shouldn't be there. And what does it actually mean to kick China out of Latin America? Well, in some cases, the President has declared he wants Chinese companies physically out of say the Panama Canal, where he exaggerated the control of the Chinese military, which has very little presence there. But what he really means is that by expanding the American economic presence, by making sure that everyone in the region buys American products and runs on American operating systems, that basically he would squeeze out the Chinese and other competitors. And of course, you travel on Latin America. What do you see? You see Huawei phones. You see Chinese 5G networks. And it's those areas where I think the President wants to get that replaced with American hardware and software. David, just to step back here for a moment, can you help me understand how the taking up of the Monroe doctrine, this new muscular posture that we're going to be taking in Latin America with new military deployments? Isn't that out of step with the original understanding that I think a lot of us had of America first as this policy of isolationism? There is certainly a split in MAGA world about isolationism and interventionism. And there are a lot of the President's followers who would like to just build big walls around the continental United States, maybe include Hawaii and Alaska in that and basically say, everybody stay away and we're not going to mess in your business. You saw MAGA members who were opposed to taking out the nuclear facilities in Iran. The President basically told them to sit down and shut up while he bombed them and then came home. But what we're discussing in Latin America is really pulling MAGA apart here because they see in our conflicts over the boats in the President's promise repeated just this week that there would be land strikes that we could end up in forever wars in our own neighborhood. So what makes this worth it to Trump? Like why risk pulling MAGA apart as you said over this? What does the US actually get out of reasserting its dominance in this really aggressive way? Well, one possibility of what we get out of it is basically a spheres of influence kind of organization of the world, something we haven't really seen since the late 1800s. This is a world in which the United States dominates its own territory that China dominates the Pacific and that the Europeans dominate Europe. But if they don't get their act together, maybe Vladimir Putin dominates Europe. It establishes essentially that we each carve up the globe and sort of respect the other territories as the other guy's problem. And of course, this is a vision that coincides with another world leader's idea of how the globe should be organized. And that's Putin himself who has frequently talked about the spheres of influence kind of organization of the world. But how is declaring a sphere of influence coherent with America first? I mean, you could see how leaving the rest of the world to its own devices jibes with an isolationist view of how to engage with the world. But help me make sense of the internal logic of declaring American predominance over an entire swath of the globe. I think this is where we see the America first doctrine becoming something closer to America's first. With an S. America's with an S that he views the region as basically the subsidiary of the United States. And you know, I've traveled with President Trump. I've covered five American presidents since I got back to Washington from all life as a foreign correspondent. And my takeaway is that Trump is really not an isolationist. He never has been. He's actually more of a unilateralist. What do you mean by that? Well, he wants the total freedom of action. He knows that he is not really interested in democracy promotion. He knows that he wants to prioritize economics and economic development over everything. Even if those economics don't necessarily come with security benefits to the US. But I also think that what's really notable about this strategy is that it doesn't cast our traditional adversaries, China and Russia, but mostly China, as global strategic challengers, much less a threat to the US. So one would think from these documents that Europe's troubles pose a greater threat to the US than any of the above. David, we've been talking about this document as a major pivot and a reorientation of American foreign policy. But I have to ask, as someone who has spent so much time covering American leaders and American actions across the globe, how enduring is the shift that we're seeing represented here? Does it last beyond this president? The closest analogy I can make is Trump and the White House itself. The next president can come in and scrape all the gold off of the Oval Office walls and put turf back down in the Rose Garden. But whoever it is is not going to be able to go rebuild the East Wing. There's going to be a ballroom and you're going to have to learn how to live with it or like it. And my guess is that the foreign policy of this president is going to have a similar effect. That at this point, the world is going to assume that the United States always has the ability to turn back in on itself and that each region of the world and even our allies are going to have to learn to depend on themselves. And I don't think that there is anything we can do over the next generation no matter who becomes elected president to make them believe that the U.S. is always going to be with them. I think the fundamental trust in the U.S. as the defender of a certain set of concepts of the West has been shattered for some time. David, thanks so much. Thank you, Natalie. We'll be right back. Here's what else you need to know today. This is one of the most consequential votes this Senate will take all year. By saying yay or nay to the clerk of the Senate, senators will decide whether people live or people die. On Thursday afternoon, Senate Republicans blocked a Democratic bill to extend federal healthcare subsidies, making it all but certain that insurance costs will surge for millions of Americans by the end of the year. The bill would have extended the subsidies for the Affordable Care Act by three years, a rallying cry for Democrats and their central motivation for shutting down the government for 43 days. But even with four Senate Republicans backing the measure, Democrats fell short of the 60 votes they needed to pass it. And President Trump signed an executive order that seeks to block states from enforcing laws that regulate the artificial intelligence industry, a win for big tech that puts dozens of AI safety and consumer protection laws at risk. The order gives the Attorney General broad authority to overturn laws that don't support the quote, United States' global AI dominance. If states keep their laws in place, Trump directed federal regulators to withhold funds for broadband and other projects. Finally, in a stinging defeat for Trump, Republican state lawmakers in Indiana have rejected a new congressional map ordered up by the White House that would have made it harder for Democrats to win any congressional seats in the state. The Republican lawmakers who voted against the new map said that it would undermine people's faith in government, and warn Trump that he should stay out of the state's politics. Today's episode was produced by Olivia Nat and Anna Foley. It was edited by Maria Byrne and Lizzo Baelin with help from Paige Cowatt. Contains music by Alicia Byrne and Mary Luzano and was engineered by Chris Wood. That's it for the Daily, I'm Natalie Kitchoweth. See you Monday."
}